{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v3.12.0", "signature": {"outputs": {"final_result": {"name": "final_result"}}}, "modelTopology": {"node": [{"name": "MobilenetV1/MobilenetV1/Conv2d_0/convolution/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_0/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "MobilenetV1/Conv2d_1_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_pointwise/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_2_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_pointwise/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_3_depthwise/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_pointwise/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "MobilenetV1/Conv2d_4_depthwise/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_pointwise/convolution/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "256"}]}}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "MobilenetV1/Conv2d_5_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_pointwise/convolution/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_6_depthwise/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_pointwise/convolution/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "MobilenetV1/Conv2d_7_depthwise/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_pointwise/convolution/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_8_depthwise/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_pointwise/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_9_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_pointwise/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "MobilenetV1/Conv2d_10_depthwise/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_pointwise/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "MobilenetV1/Conv2d_11_depthwise/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_pointwise/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_12_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_pointwise/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "MobilenetV1/Conv2d_13_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1024"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_pointwise/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Logits/Conv2d_1c_1x1/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "1001"}]}}}}}, {"name": "MobilenetV1/Logits/Conv2d_1c_1x1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1001"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "final_training_ops/weights/final_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1001"}, {"size": "4"}]}}}}}, {"name": "final_training_ops/biases/final_biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_0/BatchNorm/batchnorm/mul_1", "op": "Conv2D", "input": ["input", "MobilenetV1/MobilenetV1/Conv2d_0/convolution/merged_input"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_0/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_0/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_0/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_0/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_0/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/depthwise", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_0/Relu6", "MobilenetV1/Conv2d_1_depthwise/depthwise_weights"], "attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm/mul_1", "op": "Mul", "input": ["MobilenetV1/MobilenetV1/Conv2d_1_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm/mul_1", "op": "Conv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_1_depthwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_1_pointwise/convolution/merged_input"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/depthwise", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_1_pointwise/Relu6", "MobilenetV1/Conv2d_2_depthwise/depthwise_weights"], "attr": {"data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm/mul_1", "op": "Mul", "input": ["MobilenetV1/MobilenetV1/Conv2d_2_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm/mul_1", "op": "Conv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_2_depthwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_2_pointwise/convolution/merged_input"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/depthwise", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_2_pointwise/Relu6", "MobilenetV1/Conv2d_3_depthwise/depthwise_weights"], "attr": {"data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm/mul_1", "op": "Mul", "input": ["MobilenetV1/MobilenetV1/Conv2d_3_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm/mul_1", "op": "Conv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_3_depthwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_3_pointwise/convolution/merged_input"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/depthwise", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_3_pointwise/Relu6", "MobilenetV1/Conv2d_4_depthwise/depthwise_weights"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm/mul_1", "op": "Mul", "input": ["MobilenetV1/MobilenetV1/Conv2d_4_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm/mul_1", "op": "Conv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_4_depthwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_4_pointwise/convolution/merged_input"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/depthwise", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_4_pointwise/Relu6", "MobilenetV1/Conv2d_5_depthwise/depthwise_weights"], "attr": {"explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm/mul_1", "op": "Mul", "input": ["MobilenetV1/MobilenetV1/Conv2d_5_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm/mul_1", "op": "Conv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_5_depthwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_5_pointwise/convolution/merged_input"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/depthwise", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_5_pointwise/Relu6", "MobilenetV1/Conv2d_6_depthwise/depthwise_weights"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm/mul_1", "op": "Mul", "input": ["MobilenetV1/MobilenetV1/Conv2d_6_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm/mul_1", "op": "Conv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_6_depthwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_6_pointwise/convolution/merged_input"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/depthwise", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_6_pointwise/Relu6", "MobilenetV1/Conv2d_7_depthwise/depthwise_weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm/mul_1", "op": "Mul", "input": ["MobilenetV1/MobilenetV1/Conv2d_7_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm/mul_1", "op": "Conv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_7_depthwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_7_pointwise/convolution/merged_input"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/depthwise", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_7_pointwise/Relu6", "MobilenetV1/Conv2d_8_depthwise/depthwise_weights"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm/mul_1", "op": "Mul", "input": ["MobilenetV1/MobilenetV1/Conv2d_8_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm/mul_1", "op": "Conv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_8_depthwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_8_pointwise/convolution/merged_input"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_depthwise/depthwise", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_8_pointwise/Relu6", "MobilenetV1/Conv2d_9_depthwise/depthwise_weights"], "attr": {"data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm/mul_1", "op": "Mul", "input": ["MobilenetV1/MobilenetV1/Conv2d_9_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm/mul_1", "op": "Conv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_9_depthwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_9_pointwise/convolution/merged_input"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_depthwise/depthwise", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_9_pointwise/Relu6", "MobilenetV1/Conv2d_10_depthwise/depthwise_weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm/mul_1", "op": "Mul", "input": ["MobilenetV1/MobilenetV1/Conv2d_10_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm/mul_1", "op": "Conv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_10_depthwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_10_pointwise/convolution/merged_input"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_depthwise/depthwise", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_10_pointwise/Relu6", "MobilenetV1/Conv2d_11_depthwise/depthwise_weights"], "attr": {"data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm/mul_1", "op": "Mul", "input": ["MobilenetV1/MobilenetV1/Conv2d_11_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm/mul_1", "op": "Conv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_11_depthwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_11_pointwise/convolution/merged_input"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_depthwise/depthwise", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_11_pointwise/Relu6", "MobilenetV1/Conv2d_12_depthwise/depthwise_weights"], "attr": {"explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm/mul_1", "op": "Mul", "input": ["MobilenetV1/MobilenetV1/Conv2d_12_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm/mul_1", "op": "Conv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_12_depthwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_12_pointwise/convolution/merged_input"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_depthwise/depthwise", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_12_pointwise/Relu6", "MobilenetV1/Conv2d_13_depthwise/depthwise_weights"], "attr": {"explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm/mul_1", "op": "Mul", "input": ["MobilenetV1/MobilenetV1/Conv2d_13_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm/mul_1", "op": "Conv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_13_depthwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_13_pointwise/convolution/merged_input"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Logits/AvgPool_1a/AvgPool", "op": "AvgPool", "input": ["MobilenetV1/MobilenetV1/Conv2d_13_pointwise/Relu6"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "ksize": {"list": {"i": ["1", "7", "7", "1"]}}}}, {"name": "MobilenetV1/Logits/Conv2d_1c_1x1/BiasAdd", "op": "_FusedConv2D", "input": ["MobilenetV1/Logits/AvgPool_1a/AvgPool", "MobilenetV1/Logits/Conv2d_1c_1x1/weights", "MobilenetV1/Logits/Conv2d_1c_1x1/biases"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}}}, {"name": "MobilenetV1/Logits/SpatialSqueeze", "op": "Squeeze", "input": ["MobilenetV1/Logits/Conv2d_1c_1x1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1", "2"]}}}}, {"name": "input_1/BottleneckInputPlaceholder", "op": "PlaceholderWithDefault", "input": ["MobilenetV1/Logits/SpatialSqueeze"], "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1001"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "final_training_ops/Wx_plus_b/MatMul", "op": "MatMul", "input": ["input_1/BottleneckInputPlaceholder", "final_training_ops/weights/final_weights"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "final_training_ops/Wx_plus_b/add", "op": "AddV2", "input": ["final_training_ops/Wx_plus_b/MatMul", "final_training_ops/biases/final_biases"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "final_result", "op": "Softmax", "input": ["final_training_ops/Wx_plus_b/add"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {}}, "userDefinedMetadata": {"labels": ["1", "2", "3", "4"]}, "weightsManifest": [{"paths": ["group1-shard1of5.bin", "group1-shard2of5.bin", "group1-shard3of5.bin", "group1-shard4of5.bin", "group1-shard5of5.bin"], "weights": [{"name": "MobilenetV1/MobilenetV1/Conv2d_0/convolution/merged_input", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_0/BatchNorm/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_1_depthwise/depthwise_weights", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_pointwise/convolution/merged_input", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_2_depthwise/depthwise_weights", 